src/Enums/СтатусыСобытий/СтатусыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСобытий</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/События/События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>События</name>
  <owners>Catalog.Кампании</owners>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/СобытияКалендаря/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Прикладная логика работы с событиями календаря активной кампании.
// Все операции создания, поиска и изменения статуса событий выполняются
// через данный модуль, чтобы UI и будущий AI-слой не обращались
// к справочнику События напрямую.
//
// Представление времени в проекте - целочисленные игровые минуты
// от 1 Хаммера 1 ЛД, 00:00. Реализуется отдельным модулем ИгровойКалендарь.
//

#Область ПрограммныйИнтерфейс

// Создает новое событие активной кампании со статусом "Запланировано".
//
// Параметры:
//  Наименование - Строка - краткое название события (стандартный реквизит Description).
//  Начало       - Число  - игровое время начала события в минутах (>= 0).
//  Окончание    - Число  - игровое время окончания события в минутах.
//                          Если не указано, принимается равным Началу.
//  Описание     - Строка - произвольное описание события.
//
// Возвращаемое значение:
//  СправочникСсылка.События
//
Функция СоздатьСобытие(Наименование, Начало, Окончание = Неопределено, Описание = "") Экспорт

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;

	ПроверитьВозможностьСоздания(АктивнаяКампания, Наименование, Начало, Окончание);

	Если Окончание = Неопределено Тогда
		ОкончаниеСобытия = Начало;
	Иначе
		ОкончаниеСобытия = Окончание;
	КонецЕсли;

	СобытиеОбъект = Справочники.События.СоздатьЭлемент();
	СобытиеОбъект.Владелец     = АктивнаяКампания;
	СобытиеОбъект.Наименование = СокрЛП(Наименование);
	СобытиеОбъект.Начало       = Начало;
	СобытиеОбъект.Окончание    = ОкончаниеСобытия;
	СобытиеОбъект.Описание     = Описание;
	СобытиеОбъект.Статус       = Перечисления.СтатусыСобытий.Запланировано;
	СобытиеОбъект.Записать();

	Возврат СобытиеОбъект.Ссылка;

КонецФункции

// Возвращает события активной кампании, пересекающиеся с указанным периодом.
// Событие длительностью несколько дней попадает во все соответствующие периоды.
//
// Параметры:
//  НачалоПериода    - Число - игровое время начала периода в минутах.
//  ОкончаниеПериода - Число - игровое время окончания периода в минутах.
//
// Возвращаемое значение:
//  Массив из Структура - описание событий со следующими полями:
//    * Ссылка       - СправочникСсылка.События
//    * Наименование - Строка
//    * Начало       - Число
//    * Окончание    - Число
//    * Статус       - ПеречислениеСсылка.СтатусыСобытий
//    * Описание     - Строка
//    * Связи        - Массив из Структура - см. СвязиСущностей.ПолучитьСвязи()
//
Функция ПолучитьСобытияПериода(НачалоПериода, ОкончаниеПериода) Экспорт

	Результат = Новый Массив;

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;
	Если НЕ ЗначениеЗаполнено(АктивнаяКампания) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец",        АктивнаяКампания);
	Запрос.УстановитьПараметр("НачалоПериода",   НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	События.Ссылка КАК Ссылка,
		|	События.Наименование КАК Наименование,
		|	События.Начало КАК Начало,
		|	События.Окончание КАК Окончание,
		|	События.Статус КАК Статус,
		|	События.Описание КАК Описание
		|ИЗ
		|	Справочник.События КАК События
		|ГДЕ
		|	События.Владелец = &Владелец
		|	И События.Начало <= &ОкончаниеПериода
		|	И События.Окончание >= &НачалоПериода
		|	И НЕ События.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	События.Начало";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОписаниеСобытия = Новый Структура;
		ОписаниеСобытия.Вставить("Ссылка",       Выборка.Ссылка);
		ОписаниеСобытия.Вставить("Наименование", Выборка.Наименование);
		ОписаниеСобытия.Вставить("Начало",       Выборка.Начало);
		ОписаниеСобытия.Вставить("Окончание",    Выборка.Окончание);
		ОписаниеСобытия.Вставить("Статус",       Выборка.Статус);
		ОписаниеСобытия.Вставить("Описание",     Выборка.Описание);
		ОписаниеСобытия.Вставить("Связи",        СвязиСущностей.ПолучитьСвязи(Выборка.Ссылка));

		Результат.Добавить(ОписаниеСобытия);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Переводит событие в статус "Завершено".
//
// Параметры:
//  Событие - СправочникСсылка.События - переводимое событие.
//
Процедура ЗавершитьСобытие(Событие) Экспорт

	ИзменитьСтатусСобытия(Событие, Перечисления.СтатусыСобытий.Завершено, НСтр("ru = 'Событие уже завершено.'"));

КонецПроцедуры

// Переводит событие в статус "Отменено".
//
// Параметры:
//  Событие - СправочникСсылка.События - отменяемое событие.
//
Процедура ОтменитьСобытие(Событие) Экспорт

	ИзменитьСтатусСобытия(Событие, Перечисления.СтатусыСобытий.Отменено, НСтр("ru = 'Событие уже отменено.'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Комплексная проверка параметров при создании события.
//
// Параметры:
//  АктивнаяКампания - СправочникСсылка.Кампании - владелец создаваемого события.
//  Наименование     - Строка - проверяемое наименование.
//  Начало           - Число - проверяемое время начала.
//  Окончание        - Число, Неопределено - проверяемое время окончания.
//
Процедура ПроверитьВозможностьСоздания(АктивнаяКампания, Наименование, Начало, Окончание)

	Если НЕ ЗначениеЗаполнено(АктивнаяКампания) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Создание события невозможно.'");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Наименование)
		ИЛИ НЕ ЗначениеЗаполнено(СокрЛП(Наименование)) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено наименование события.'");
	КонецЕсли;

	Если Начало < 0 Тогда
		ВызватьИсключение НСтр("ru = 'Время начала события не может быть отрицательным.'");
	КонецЕсли;

	Если Окончание <> Неопределено
		И Окончание < Начало Тогда
		ВызватьИсключение НСтр("ru = 'Время окончания события не может быть раньше времени начала.'");
	КонецЕсли;

КонецПроцедуры

// Читает и обновляет статус события, предотвращая бессмысленные переходы.
//
// Параметры:
//  Событие                  - СправочникСсылка.События - переводимое событие.
//  НовыйСтатус              - ПеречислениеСсылка.СтатусыСобытий - устанавливаемый статус.
//  СообщениеПовторногоПерехода - Строка - текст исключения при попытке сменить
//                                        финальный статус события.
//
Процедура ИзменитьСтатусСобытия(Событие, НовыйСтатус, СообщениеПовторногоПерехода)

	Если НЕ ЗначениеЗаполнено(Событие) Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие.'");
	КонецЕсли;

	РеквизитыСобытия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Событие, "Статус, Владелец");

	Если РеквизитыСобытия.Статус = НовыйСтатус Тогда
		Возврат;
	КонецЕсли;

	Если РеквизитыСобытия.Статус = Перечисления.СтатусыСобытий.Завершено
		ИЛИ РеквизитыСобытия.Статус = Перечисления.СтатусыСобытий.Отменено Тогда
		ВызватьИсключение СообщениеПовторногоПерехода;
	КонецЕсли;

	Если РеквизитыСобытия.Владелец <> ПараметрыСеанса.АктивнаяКампания Тогда
		ВызватьИсключение НСтр("ru = 'Событие не принадлежит активной кампании.'");
	КонецЕсли;

	СобытиеОбъект = Событие.ПолучитьОбъект();
	СобытиеОбъект.Статус = НовыйСтатус;
	СобытиеОбъект.Записать();

КонецПроцедуры

#КонецОбласти
